# GetKeys Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportPatternTable..::..GetKeys Method
ExportPatternTable Class See Also
---
Gets all the keys stored in the map.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public IList<ExportPatternKey> GetKeys()
```

Visual Basic
---
```text
Public Function GetKeys As IList(Of ExportPatternKey)
```

Visual C++
---
```text
public:
IList<ExportPatternKey^>^ GetKeys()
```

# ### Return Value
Return the key array.
# See Also
ExportPatternTable Class
Autodesk.Revit.DB Namespace